<a href="https://colab.research.google.com/github/mukaseevru/ds-school/blob/main/lesson%206/More_about_SQL_solved.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## План занятия

- Повторим как создавать БД при помощи SQLalchemy
- Разберем новые операторы в SQL
- Разберем подробнее ORM (объектно-реляционное отображение) в SQLalchemy

(задание из презентации)

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
prices = np.random.permutation(np.arange(10))
prices

array([0, 7, 1, 6, 5, 3, 8, 9, 4, 2])

In [3]:
k = 3
for i in range(len(prices)):
    n_leq = 0
    for j in range(len(prices)):
        if prices[j] >= prices[i]:
            n_leq += 1
    if n_leq == k:
        print(prices[i])
        break

7

# SQLAlchemy. Recap

In [4]:
import sys
from sqlalchemy import Column, ForeignKey, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship
from sqlalchemy import create_engine

In [5]:
from IPython.display import display
import pandas as pd
import sqlalchemy

def sql(query):
    print()
    print(query)
    print()

def get_results(query):
    global engine
    q = query.statement if isinstance(query, sqlalchemy.orm.query.Query) else query
    return pd.read_sql(q, engine)

def display_results(query):
    df = get_results(query)
    display(df)
    #sql(query)

In [6]:
Base = declarative_base()

class Person(Base):
    __tablename__= 'person'
    id = Column(Integer, primary_key=True)
    name = Column(String(250), nullable=False)
    
class Address(Base):
    __tablename__ = 'address'
    id = Column(Integer, primary_key=True)
    country = Column(String(250))
    state = Column(String(250))
    street_name = Column(String(250))
    street_number = Column(String(250))
    post_code = Column(String(250))
    person_id = Column(Integer, ForeignKey('person.id'))
    person = relationship(Person)

engine = create_engine('sqlite:///sqlalchemy_example.db')

connection = engine.connect()

Base.metadata.create_all(engine)

In [7]:
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

In [8]:
DBSession = sessionmaker(bind=engine)
session = DBSession()

new_person = Person(name='Nawin')
session.add(new_person)
session.commit()

new_address = Address(post_code='48103',country = 'USA', state = 'WA', street_name ='West Huron Street',street_number ='1', person=new_person)
session.add(new_address)
session.commit()

In [9]:
engine.table_names()

['address', 'person']

In [10]:
from sqlalchemy import select 

query = select([Person])
display_results(query)

    id   name
0    1  Nawin
1    2  Moshe
2    3   Lisa
3    4   Nika
4    5    Max
5    6    Dan
6    7   Alex
7    8  Nawin
8    9    Max
9   10    Dan
10  11   Alex
11  12  Nawin

In [11]:
query = select([Address])
display_results(query)

   id country   state        street_name street_number post_code  person_id
0   1     USA      WA  West Huron Street             1     48103          1
1   2  Russia  Moscow    Pervomay Street            42    141700          2
2   3  Russia  Moscow    Pervomay Street            42    141700          3
3   4     USA      CA       Green Street           104    655689          4
4   5     USA      WA  West Huron Street             1     48103          8
5   6     USA      WA  West Huron Street             1     48103         12

Добавим несколько людей с разными адресами

In [12]:
from sqlalchemy import exists
def record_exists(session, name):
    return session.query(exists().where(Person.name == name)).scalar()

In [13]:
record_exists(session, 'Nawin')

True

In [14]:
record_exists(session, 'Lisa')

True

In [15]:
names = ['Moshe', 'Lisa', 'Nika']
adress_info = [('141700', 'Russia', 'Moscow', 'Pervomay Street', '42'), #Moshe adress
               ('141700', 'Russia', 'Moscow', 'Pervomay Street', '42'), #Lisa adress
               ('655689', 'USA', 'CA', 'Green Street', '104')] #Nika adress

In [16]:
for i, name, adress in zip(range(len(names)), names, adress_info):
    if not record_exists(session, name):
        new_person = Person(name=name)
        new_address = Address(country=adress[1],state=adress[2], street_number=adress[4], post_code=adress[0],street_name =adress[3], person=new_person)
        session.add(new_person)
        session.add(new_address)
    else:
        print("Already exists, skipping...")

session.commit()

Already exists, skipping...
Already exists, skipping...
Already exists, skipping...

Проверим теперь таблицу

In [17]:
query = select([Person.id, Person.name])
display_results(query)

    id   name
0    1  Nawin
1    2  Moshe
2    3   Lisa
3    4   Nika
4    5    Max
5    6    Dan
6    7   Alex
7    8  Nawin
8    9    Max
9   10    Dan
10  11   Alex
11  12  Nawin

In [18]:
query = select([Address])
display_results(query)

   id country   state        street_name street_number post_code  person_id
0   1     USA      WA  West Huron Street             1     48103          1
1   2  Russia  Moscow    Pervomay Street            42    141700          2
2   3  Russia  Moscow    Pervomay Street            42    141700          3
3   4     USA      CA       Green Street           104    655689          4
4   5     USA      WA  West Huron Street             1     48103          8
5   6     USA      WA  West Huron Street             1     48103         12

Другой способ добавления с использованием **add_all()**

In [19]:
session.add_all([Person(name='Max'),
                 Person(name='Dan'),
                 Person(name='Alex')])
session.commit()

In [20]:
query = select([Person.id, Person.name])
display_results(query)

    id   name
0    1  Nawin
1    2  Moshe
2    3   Lisa
3    4   Nika
4    5    Max
5    6    Dan
6    7   Alex
7    8  Nawin
8    9    Max
9   10    Dan
10  11   Alex
11  12  Nawin
12  13    Max
13  14    Dan
14  15   Alex

In [21]:
query = select([Address])
display_results(query)

   id country   state        street_name street_number post_code  person_id
0   1     USA      WA  West Huron Street             1     48103          1
1   2  Russia  Moscow    Pervomay Street            42    141700          2
2   3  Russia  Moscow    Pervomay Street            42    141700          3
3   4     USA      CA       Green Street           104    655689          4
4   5     USA      WA  West Huron Street             1     48103          8
5   6     USA      WA  West Huron Street             1     48103         12

# Синтаксис 'чистых' SQL запросов. Повторение + новый материал

## Create

In [22]:
engine.table_names()

['address', 'person']

In [23]:
connection.execute('''
CREATE TABLE friends (
    id_ INT UNSIGNED AUTO_INCREMENT,
    friendName VARCHAR(50),
    phone VARCHAR(50),
    addressLine1 VARCHAR(50),
    addressLine2 VARCHAR(50),
    city VARCHAR(50),
    state VARCHAR(50),
    postalCode VARCHAR(50),
    country VARCHAR(50),
    PRIMARY KEY(id_)
);
''')

In [24]:
engine.table_names()

['address', 'friends', 'person']

In [25]:
result = connection.execute("select * from friends")
for row in result:
    print("Friend info", row)

In [26]:
pd.read_sql('SELECT * from friends;', connection)

Empty DataFrame
Columns: [id_, friendName, phone, addressLine1, addressLine2, city, state, postalCode, country]
Index: []

In [27]:
pd.read_sql('SELECT * from person;', connection)

    id   name
0    1  Nawin
1    2  Moshe
2    3   Lisa
3    4   Nika
4    5    Max
5    6    Dan
6    7   Alex
7    8  Nawin
8    9    Max
9   10    Dan
10  11   Alex
11  12  Nawin
12  13    Max
13  14    Dan
14  15   Alex

In [28]:
result = connection.execute(
'''SELECT
    country,
    state,
    post_code
FROM 
    address
WHERE 
    country = 'USA' AND 
    state = 'CA';
''')

for row in result:
    print("adress info", row)

adress info ('USA', 'CA', '655689')

## Insert into

In [29]:
connection.execute(
"""
INSERT INTO friends (
    id_,
    country,
    state,
    postalCode
)
VALUES (1, "UK", "London", 5678)
"""
)

In [30]:
pd.read_sql('SELECT * from friends;', connection)

   id_ friendName phone addressLine1  ...  city   state postalCode country
0    1       None  None         None  ...  None  London       5678      UK

[1 rows x 9 columns]

## Update

In [31]:
connection.execute(
'''
UPDATE friends 

SET
    friendName = "Mike"
WHERE 
    country = "UK"
''')

In [32]:
pd.read_sql('SELECT * from friends;', connection)

   id_ friendName phone addressLine1  ...  city   state postalCode country
0    1       Mike  None         None  ...  None  London       5678      UK

[1 rows x 9 columns]

## Insert into select

In [33]:
connection.execute(
'''
INSERT INTO friends (
    country,
    state,
    postalCode
)
SELECT
    country,
    state,
    post_code
FROM 
    address
WHERE 
    country = 'USA' AND 
    state = 'CA';
''')

In [34]:
pd.read_sql('SELECT * from friends;', connection)

   id_ friendName phone addressLine1  ...  city   state postalCode country
0  1.0       Mike  None         None  ...  None  London       5678      UK
1  NaN       None  None         None  ...  None      CA     655689     USA

[2 rows x 9 columns]

## Drop

In [35]:
connection.execute('DROP TABLE friends;')

In [36]:
engine.table_names()

['address', 'person']

## Create view

CREATE VIEW создаст представление по заданному вами условию

In [37]:
connection.execute('''
CREATE VIEW test_view AS
    SELECT 
        street_name, 
        street_number
    FROM
        address
    ORDER BY street_number;
''')

In [38]:
engine.table_names()

['address', 'person']

Но в pandas таблицы и представления разделяют одно пространство имен

In [39]:
pd.read_sql('SELECT * from test_view;', connection)

         street_name street_number
0  West Huron Street             1
1  West Huron Street             1
2  West Huron Street             1
3       Green Street           104
4    Pervomay Street            42
5    Pervomay Street            42

In [40]:
connection.execute('''
drop view test_view;
''')

## Case

Выражение MySQL CASE - это структура потока управления, которая позволяет добавлять логику if-else к запросу. Вообще говоря, вы можете использовать выражение CASE в любом месте, которое допускает допустимое выражение, например, предложения SELECT, WHERE и ORDER BY.

In [41]:
pd.read_sql('SELECT * from address;', connection)

   id country   state        street_name street_number post_code  person_id
0   1     USA      WA  West Huron Street             1     48103          1
1   2  Russia  Moscow    Pervomay Street            42    141700          2
2   3  Russia  Moscow    Pervomay Street            42    141700          3
3   4     USA      CA       Green Street           104    655689          4
4   5     USA      WA  West Huron Street             1     48103          8
5   6     USA      WA  West Huron Street             1     48103         12

In [42]:
pd.read_sql('''
SELECT 
    
    country `Страна`,
    CASE country
		WHEN "Russia" THEN 'Живет в России'
        WHEN "USA" THEN 'Живет в США'
        ELSE 'Живет в другой стране'
	end `Страна проживания`
FROM
    (SELECT 
		country
	FROM
		address
	INNER JOIN person
		ON  address.person_id = person.id) as cte
ORDER BY country;
''', connection)

   Страна Страна проживания
0  Russia    Живет в России
1  Russia    Живет в России
2     USA       Живет в США
3     USA       Живет в США
4     USA       Живет в США
5     USA       Живет в США

ЗАДАНИЕ

Добавить еще один столбец - Имя человека

In [43]:
# TODO

In [44]:
pd.read_sql('''
SELECT 
    name 'Имя',
    country 'Страна',
    CASE country
		WHEN "Russia" THEN 'Живет в России'
        WHEN "USA" THEN 'Живет в США'
        ELSE 'Живет в другой стране'
	end 'Страна проживания'
FROM
    (SELECT 
		country,
        name
	FROM
		address
	INNER JOIN person
		USING (id))
ORDER BY country;
''', connection)

     Имя  Страна Страна проживания
0  Moshe  Russia    Живет в России
1   Lisa  Russia    Живет в России
2  Nawin     USA       Живет в США
3   Nika     USA       Живет в США
4    Max     USA       Живет в США
5    Dan     USA       Живет в США

Вопрос: Почему в данном случае плохо использовать следующий синтаксис "JOIN ... USING (id)" ?

Как это исправить?

In [45]:
#TODO

In [46]:
pd.read_sql('''
SELECT 
    name 'Имя',
    country 'Страна',
    CASE country
		WHEN "Russia" THEN 'Живет в России'
        WHEN "USA" THEN 'Живет в США'
        ELSE 'Живет в другой стране'
	end 'Страна проживания'
FROM
    (SELECT 
		country,
        name
	FROM
		address
	INNER JOIN person
		ON  address.person_id = person.id)
ORDER BY country;
''', connection)

     Имя  Страна Страна проживания
0  Moshe  Russia    Живет в России
1   Lisa  Russia    Живет в России
2  Nawin     USA       Живет в США
3   Nika     USA       Живет в США
4  Nawin     USA       Живет в США
5  Nawin     USA       Живет в США

In [47]:
# TODO

ДОП ЗАДАНИЕ**

Если человек живет в Москве, то вывести его имя, улицу и почтовый код

In [48]:
pd.read_sql('''
SELECT 
    name 'Имя',
--    state 'Город',
    street_name 'Улица',
    post_code 'Почтовый код'
--    CASE state
--		WHEN "Moscow" THEN 'Живет в Москве'
--    ELSE 'Живет в другом городе'
--	  END 'Город проживания'
FROM
    (SELECT state, name, street_name, post_code
	  FROM address
	  INNER JOIN person ON address.person_id = person.id)
WHERE state = 'Moscow'
ORDER BY state;
''', connection)

     Имя            Улица Почтовый код
0  Moshe  Pervomay Street       141700
1   Lisa  Pervomay Street       141700

Задача на изображении HW_task.png решена в файле Add_column_without_OVER().ipynb

# Работа с датами

## Date

MySQL DATE - один из пяти временных типов данных, используемых для управления значениями даты. MySQL использует формат гггг-мм-дд для хранения значения даты. Этот формат является фиксированным, и его невозможно изменить. (Для собственных форматов дат используйте DATE_FORMAT)

MySQL использует 3 байта для хранения значения DATE. Значения ДАТЫ варьируются от 1000-01-01 до 9999-12-31.

In [49]:
connection.execute('''
CREATE TABLE people (
    id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    birth_date DATE NOT NULL
);
''')

In [50]:
engine.table_names()

['address', 'people', 'person']

In [51]:
pd.read_sql('''SELECT * from people''', connection)

Empty DataFrame
Columns: [id, first_name, last_name, birth_date]
Index: []

Добавим элемент

In [52]:
connection.execute('''
INSERT INTO people(first_name, last_name, birth_date)
VALUES('John','Doe','1990-09-01');
''')

Посмотрим на результат

In [53]:
pd.read_sql('''
SELECT 
    first_name, 
    last_name, 
    birth_date
FROM
    people;
''', connection)

  first_name last_name  birth_date
0       John       Doe  1990-09-01

## Функции от дат

In [54]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/6c/1d/e666f7d43496a2315d3963a2fb7f8df84e7293b4ddbf05e46d6bdb4a8892/mysql_connector_python-8.0.22-cp36-cp36m-manylinux1_x86_64.whl (18.0MB)
     |████████████████████████████████| 18.0MB 235kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (50.3.2)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.22

In [55]:
import datetime
datetime.datetime.now() #текущее время

datetime.datetime(2020, 12, 17, 17, 53, 25, 402298)

In [56]:
pd.read_sql('''
SELECT CURRENT_TIMESTAMP
''', connection)

     CURRENT_TIMESTAMP
0  2020-12-17 17:53:25

In [57]:
pd.read_sql('''
SELECT DATE(CURRENT_TIMESTAMP) as `текущее время`;
''', connection)

  текущее время
0    2020-12-17

In [58]:
pd.read_sql('''
SELECT CURRENT_TIME
''', connection)

  CURRENT_TIME
0     17:53:25

## Работа с триггером

Триггеры по своей сути представляют обработчики событий. Они выполняются при наступлении какого-либо простого действия в SQL. Такими действиями обычно являются: удаление, вставка и обновление данных.

То есть, триггер — это по сути ловушка, которая срабатывает при определенном действии. Триггер позволяет автоматизировать некоторые расчетные рутинные действия. Примеры мы разберем дальше.

Оператор для создания следующий:

`CREATE TRIGGER name_trigger`

После оператора и имени триггера необходимо указать в каком случае будет срабатывать триггер. Возможно 6 вариантов:

* BEFORE INSERT
* BEFORE UPDATE
* BEFORE DELETE
* AFTER INSERT
* AFTER UPDATE
* AFTER DELETE

In [59]:
connection.execute(
'''
CREATE TABLE IF NOT EXISTS test_table(
    id int INTEGER AUTO_INCREMENT PRIMARY KEY NOT NULL,
    text TEXT NOT NULL
);
''')

In [60]:
connection.execute('''
    CREATE TABLE IF NOT EXISTS log_data(
        id int AUTO_INCREMENT PRIMARY KEY,
        action text not null,
        table_name text not null
    );
''')

In [61]:
connection.execute('''
    CREATE TRIGGER log_changes AFTER INSERT ON test_table
    FOR EACH ROW BEGIN
        INSERT INTO log_data (table_name, action) 
        VALUES ('test_table', 'add row');
    END;
''')

In [62]:
connection.execute('''
insert into test_table(id, text) values (1, 'tt')
''')

In [63]:
pd.read_sql('Select * from test_table', connection)

   id text
0   1   tt

In [64]:
pd.read_sql('Select * from log_data', connection)

     id   action  table_name
0  None  add row  test_table

In [65]:
connection.execute('''
insert into test_table(id, text) values (2, 'tt')
''')

In [66]:
pd.read_sql('Select * from log_data', connection)

     id   action  table_name
0  None  add row  test_table
1  None  add row  test_table

Создание базы данных подписок по id

In [67]:
connection.execute('''
CREATE TABLE IF NOT EXISTS subscriptions(
    subscriptionId INT AUTO_INCREMENT,
    userId INT,
    dailyEmail BOOLEAN NOT NULL DEFAULT FALSE,
    weeklyEmail BOOLEAN NOT NULL DEFAULT FALSE,
    specialOffer BOOLEAN NOT NULL DEFAULT FALSE,
    phone BOOLEAN NOT NULL DEFAULT FALSE,
    PRIMARY KEY (subscriptionId)
    );
''')

Создание базы данных пользователей с внешним ключем на список подписок

In [68]:
connection.execute('''
CREATE TABLE IF NOT EXISTS users(
    userId INT AUTO_INCREMENT,
    subscription_id INT,
    firstName VARCHAR(255) NOT NULL,
    secondName VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL,
    emailConfimed BOOLEAN NOT NULL DEFAULT FALSE,
    PRIMARY KEY (userId),
    FOREIGN KEY (subscription_id)
        REFERENCES subscriptions(subscriptionId)
        ON UPDATE RESTRICT ON DELETE CASCADE
    );
''')

Загрузим пустую бд и удалим id (чтоб не получить ошибки автоинкремента)

In [69]:
subscriptions = pd.read_sql('Select * from subscriptions', connection)
# дропаем столбец, который автоинкрементируется
del subscriptions['subscriptionId']
subscriptions.head()

Empty DataFrame
Columns: [userId, dailyEmail, weeklyEmail, specialOffer, phone]
Index: []

добавим строку в конец датафрейма

In [70]:
subscriptions.loc[len(subscriptions)] = [0, False, False, False, False]
subscriptions.head()

  userId dailyEmail weeklyEmail specialOffer  phone
0      0      False       False        False  False

Добавим датафрейм в таблицу

In [71]:
# добавляем в конец
subscriptions.to_sql('subscriptions', connection, if_exists='append', index=False)

In [72]:
pd.read_sql('Select * from subscriptions', connection)

  subscriptionId  userId  dailyEmail  weeklyEmail  specialOffer  phone
0           None       0           0            0             0      0


Создадим пользователя и удалим userId (чтоб не было ошибок автоинкремента)

In [73]:
# создаем пользователя
users = pd.read_sql('Select * from users', connection)
# дропаем столбец, который автоинкрементируется
del users['userId']
users.head()

Empty DataFrame
Columns: [subscription_id, firstName, secondName, email, emailConfimed]
Index: []

In [74]:
users.loc[len(users)] = [1, 'Illya', 'Tykhov', 'tixons.work@gmail.com', True]
users.head()

  subscription_id firstName secondName                  email emailConfimed
0               1     Illya     Tykhov  tixons.work@gmail.com          True

Добавим датафрейм в таблицу sql

In [75]:
users.to_sql('users', connection, if_exists='append', index=False)

In [76]:
pd.read_sql('Select * from users', connection)

  userId  subscription_id  ...                  email emailConfimed
0   None                1  ...  tixons.work@gmail.com             1

[1 rows x 6 columns]

Агрегатная функция выполняет вычисление для нескольких значений и возвращает одно значение. Например, можно использовать агрегатную функцию AVG (), которая принимает несколько чисел и возвращает среднее значение чисел. Синтаксис:

`
function_name(DISTINCT | ALL expression)
`

In [77]:
pd.read_sql('''
SELECT 
    COUNT(subscription_id) `количество`,
    AVG(subscription_id) `средняя величина`,
    MIN(subscription_id) `минимальная величина`,
    MAX(subscription_id) `максимальная величина`
FROM 
    users;
''', connection)

   количество  средняя величина  минимальная величина  максимальная величина
0           1               1.0                     1                      1

In [78]:
pd.read_sql('''
SELECT 
    firstName `Имя`, 
    COUNT(*) `Количество`
FROM
    users
GROUP BY subscription_id
ORDER BY subscription_id;
''', connection)

     Имя  Количество
0  Illya           1

In [79]:
# Пример интерфейса для работы с данными

In [80]:
import sqlite3
conn = sqlite3.connect('mydatabase.db')

cursor = conn.cursor()

In [81]:
cursor.execute(
'''
CREATE TABLE user
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    name VARCHAR(255),
    lastName VARCHAR(255),
    age integer,
    deletedFlg integer
    )
'''
)
conn.commit()

In [82]:
cursor.execute(
'''
INSERT INTO user(
    name,
    lastName,
    age,
    deletedFlg
)
VALUES ('Петя', 'Иванов', 31, 0)
'''
)
conn.commit()

In [83]:
cursor.execute('SELECT * FROM user')
db_ =  cursor.fetchall()

for element in db_:
    print(element)

(1, 'Петя', 'Иванов', 31, 0)

Добавим еще элементов 2умя способами

1 способ

In [84]:
cursor.execute(
'''
INSERT INTO user(
    name,
    lastName,
    age,
    deletedFlg
)
VALUES ('Катя', 'Петрова', 30, 0),
        ('Аня', 'Воронцова', 25, 0),
        ('Дима', 'Петров', 35, 0)
'''
)
conn.commit()

In [85]:
cursor.execute('SELECT * FROM user')
db_ =  cursor.fetchall()

for element in db_:
    print(element)

(1, 'Петя', 'Иванов', 31, 0)
(2, 'Катя', 'Петрова', 30, 0)
(3, 'Аня', 'Воронцова', 25, 0)
(4, 'Дима', 'Петров', 35, 0)

2 способ

In [86]:
values = [
          ('Карина', 'Иванова', 26, 0),
          ('Вася', 'Воронцов', 28, 0),
          ('Света', 'Михайлова', 31, 0)
]

cursor.executemany('''
INSERT INTO user(
    name,
    lastName,
    age,
    deletedFlg
)
VALUES (?, ?, ?, ?)
''', values)
conn.commit()

In [87]:
cursor.execute('SELECT * FROM user')
db_ =  cursor.fetchall()

for element in db_:
    print(element)

(1, 'Петя', 'Иванов', 31, 0)
(2, 'Катя', 'Петрова', 30, 0)
(3, 'Аня', 'Воронцова', 25, 0)
(4, 'Дима', 'Петров', 35, 0)
(5, 'Карина', 'Иванова', 26, 0)
(6, 'Вася', 'Воронцов', 28, 0)
(7, 'Света', 'Михайлова', 31, 0)

ЗАДАНИЕ

Как вывести результат в таблице pandas dataframe?

In [88]:
# TODO

In [89]:
pd.read_sql('''
SELECT * FROM user
''', conn)

   id    name   lastName  age  deletedFlg
0   1    Петя     Иванов   31           0
1   2    Катя    Петрова   30           0
2   3     Аня  Воронцова   25           0
3   4    Дима     Петров   35           0
4   5  Карина    Иванова   26           0
5   6    Вася   Воронцов   28           0
6   7   Света  Михайлова   31           0

Пример интерфейса для дальнейшей работы с данными

In [90]:
import sqlite3
import pandas as pd

class my_interface():
    # db_name - название таблицы
    def __init__(self, db_name):
        # создаем объект подключения с названием бд
        self.conn = sqlite3.connect(f'{db_name}.db')
        # операции с бд
        self.cursor = self.conn.cursor()
        
        # создание таблиц
        # таблица пользователей
        self.create_users()
        # таблица логирования
        self.create_log_info()
        
#         print(pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn) )
    
    # создание таблицы пользователей
    def create_users(self):
        try:
            self.cursor.execute(
            '''
            CREATE TABLE users
                (id INTEGER PRIMARY KEY AUTOINCREMENT,
                name VARCHAR(255),
                lastName VARCHAR(255),
                age integer,
                deletedFlg integer
                )
            '''
            )
        except Exception as e:
            print(e)
      
    # создание таблицы логирования
    def create_log_info(self):
        try:
            self.cursor.execute(
            '''
            CREATE TABLE loginfo
                (id INTEGER PRIMARY KEY AUTOINCREMENT,
                tablename VARCHAR(255) NOT NULL,
                action VARCHAR(255) NOT NULL,
                timestamp DATE DEFAULT (datetime('now','localtime'))
                )
            '''
            )
        except Exception as e:
            print(e)
      
    # логирование действий
    def log_info(self, tablename, action):
        self.cursor.execute(f'INSERT INTO loginfo(tablename, action) VALUES (\'{tablename}\', \'{action}\');')
        self.conn.commit()
      
    # логическое удаление из таблицы tablename по id
    def delete(self, tablename, id_, **kwargs):
        print(f'UPDATE {tablename} SET deletedFlg = 1 WHERE id = {id_}')
        self.cursor.execute(f'UPDATE {tablename} SET deletedFlg = 1 WHERE id = {id_}')
        self.log_info(tablename, 'delete')
        self.conn.commit()

    # отобразить данные из тыблицы tablename с ограничениями, описанными в kwargs
    def show_data(self, tablename, **kwargs):
        self.log_info(tablename, 'show')
        if kwargs != {}:
            if kwargs.get('limit') is not None:
                # возвращаем запрос с ограничениями на кол-во элементов, которые считываем из kwargs
                return pd.read_sql(f"SELECT * FROM {tablename} LIMIT {kwargs.get('limit')};", self.conn) 
        return pd.read_sql(f"SELECT * FROM {tablename}", self.conn) 
      
#     def add_users(self, values):
#         self.cursor.executemany('''
#         INSERT INTO users(    
#             name,
#             lastName,
#             age,
#             deletedFlg
#         )
#         VALUES (?, ?, ?, ?)
#         ''', values)
#         self.conn.commit()
    
    # добавление данных в таблицу tablename с полями, описанными в fields (list)
    def add_data(self, tablename, fields, values):
        # продумать интеграцию через to_sql библиотеки pandas
        # вставляем значения в таблицу, распаковываем названия полей и ? для подстановки данных
        # объединяем в одну строку суммированием
        self.cursor.executemany(
              "INSERT INTO " + 
              tablename + '(' + 
              ', '.join(fields) +
              ') VALUES (' + 
              ', '.join(['?' for i in range(len(values[0]))]) + ');'
        , values)
        self.conn.commit()
        self.log_info(tablename, 'add')

In [91]:
values = [
          ('Аня', 'Иванова', 26, 0),
          ('Вася', 'Воронцов', 28, 0),
          ('Лена', 'Петрова', 31, 0)
        ]

ЗАДАНИЕ

1. Создать таблицу при помощи my_interface()

In [92]:
# TODO

In [93]:
interface = my_interface('my_interface')
type(interface)

__main__.my_interface

In [94]:
interface.show_data('users')

Empty DataFrame
Columns: [id, name, lastName, age, deletedFlg]
Index: []

2. Добавить данные в таблицу `users` при помощи метода add_data()

In [95]:
# TODO

In [96]:
interface.add_data('users', ['name', 'lastName', 'age', 'deletedFlg'], values)

In [97]:
interface.show_data('users')

   id  name  lastName  age  deletedFlg
0   1   Аня   Иванова   26           0
1   2  Вася  Воронцов   28           0
2   3  Лена   Петрова   31           0

3. Удалить пользователя с id = 1 при помощи delete()

In [98]:
# TODO

In [99]:
interface.delete('users', 1)

UPDATE users SET deletedFlg = 1 WHERE id = 1

In [100]:
interface.show_data('users')

   id  name  lastName  age  deletedFlg
0   1   Аня   Иванова   26           1
1   2  Вася  Воронцов   28           0
2   3  Лена   Петрова   31           0

4. Вывести логи по всем предыдущим операциям show_data('loginfo', limit = 5)

In [101]:
# TODO

In [102]:
interface.show_data('loginfo', limit = 5)

   id tablename  action            timestamp
0   1     users    show  2020-12-17 17:53:26
1   2     users     add  2020-12-17 17:53:26
2   3     users    show  2020-12-17 17:53:26
3   4     users  delete  2020-12-17 17:53:26
4   5     users    show  2020-12-17 17:53:26

# ORM (объектно-реляционное отображение) на примере SQLalchemy

В этой части мы пройдем основные функции и подходы к созданию БД при помощи такого замечательного инструмента как SQLAlchemy :)

Переключим наше внимание на объектно-реляционное отображение. Первой целью является использование описанной нами системы таблиц метаданных для предоставления возможности переноса функций заданного пользователем класса на коллекцию столбцов в таблице базы данных. Второй целью является предоставление возможности описания отношений между заданными пользователем классами, которые будут основываться на отношениях между таблицами в базе данных.

В **SQLAlchemy** такая связь называется «отображением», что соответствует широко известному шаблону проектирования с названием «DataMapper»

## Классическое представление классов таблиц

Объект класса `sqlalchemy.orm.mapper.Mapper` связывает колонки из схемы таблицы и атрибуты Python класса.

In [103]:
from sqlalchemy import Table, MetaData, Column, Integer, String, ForeignKey
from sqlalchemy.orm import mapper, relationship

metadata = MetaData()

user = Table('user', metadata,
             Column('id', Integer, primary_key=True),
             Column('name', String(50)),
             Column('fullname', String(50)),
             Column('password', String(12))
             )


address = Table('address', metadata,
                Column('id', Integer, primary_key=True),
                Column('user_id', Integer, ForeignKey('user.id')),
                Column('email_address', String(50))
                )


class User(object):
    pass


class Address(object):
    pass

print(dir(User))

mapper(
    User, user,
    properties={
        'addresses': relationship(Address, backref='user',
                                  order_by=address.c.id)
    })

print(dir(User))

mapper(Address, address)

['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__']
['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_sa_class_manager', 'addresses', 'fullname', 'id', 'name', 'password']

## Декларативное представление классов таблиц

Каждый класс, представляющий таблицу в БД, должен наследоваться от базового класса который создается при помощи функции `sqlalchemy.ext.declarative.declarative_base().`

In [104]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [105]:
from sqlalchemy import Column, Integer, String

class User(Base):
     __tablename__ = 'user'

     id = Column(Integer, primary_key=True)
     name = Column(String)
     fullname = Column(String)

     def __repr__(self):
         return "<User(%r, %r)>" % (
                 self.name, self.fullname
             )

## Схема таблицы

Для каждого класса унаследованного от базового автоматически создается схема таблицы (объект класса sqlalchemy.schema.Table) и привязывается к нему через атрибут` __table__.`

In [106]:
User.__table__

Table('user', MetaData(bind=None), Column('id', Integer(), table=<user>, primary_key=True, nullable=False), Column('name', String(), table=<user>), Column('fullname', String(), table=<user>), schema=None)

## MetaData

Любой класс таблицы автоматически ассоциируется с объектом sqlalchemy.schema.Table, который автоматически добавляется в список `sqlalchemy.schema.MetaData. `

Базовый класс `Base`, созданный при помощи функции `sqlalchemy.ext.declarative.declarative_base()`, является более высокоуровневой абстракцией над `sqlalchemy.schema.MetaData`, которая позволяет описывать таблицы декларативным способом. Таким образом все классы-таблицы имеют свою схему, которая хранится в атрибуте metadata базового класса Base:

In [107]:
Base.metadata

MetaData(bind=None)

In [108]:
Base.metadata.tables.items()

dict_items([('user', Table('user', MetaData(bind=None), Column('id', Integer(), table=<user>, primary_key=True, nullable=False), Column('name', String(), table=<user>), Column('fullname', String(), table=<user>), schema=None))])

Благодаря тому что Base содержит в себе объект `sqlalchemy.schema.MetaData`, вы можете пользоваться всеми его возможностями.

In [109]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://')
Base.metadata.create_all(engine)

## Mapper

Объект класса `sqlalchemy.orm.mapper.Mapper` связывает колонки из схемы таблицы и атрибуты из класса таблицы унаследованного от Base.

In [110]:
from sqlalchemy import Column, ForeignKey, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship

Base = declarative_base()


class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    password = Column('password', String)

    addresses = relationship("Address", backref="user",
                             order_by="Address.id")


class Address(Base):
    __tablename__ = 'address'

    id = Column(Integer, primary_key=True)
    user_id = Column(ForeignKey('user.id'))
    email_address = Column(String)

address1 = Address(email_address="vas@example.com")
address2 = Address(email_address="vas2@example.com")
address3 = Address(email_address="vasya@example.com")

print("Mapper relationship: " + str(User.__mapper__.relationships))
print("Mapper columns: " + str(User.__mapper__.c.items()))

user1 = User(name="Вася")
user1.addresses = [address1, address2, address3]
print("User1 columns: " + str(user1.__table__.c.items()))
print(address1.user.name)

Mapper relationship: <sqlalchemy.util._collections.ImmutableProperties object at 0x7fb2083fd308>
Mapper columns: [('id', Column('id', Integer(), table=<user>, primary_key=True, nullable=False)), ('name', Column('name', String(), table=<user>)), ('fullname', Column('fullname', String(), table=<user>)), ('password', Column('password', String(), table=<user>))]
User1 columns: [('id', Column('id', Integer(), table=<user>, primary_key=True, nullable=False)), ('name', Column('name', String(), table=<user>)), ('fullname', Column('fullname', String(), table=<user>)), ('password', Column('password', String(), table=<user>))]
Вася

In [111]:
engine = create_engine('sqlite://')
Base.metadata.create_all(engine)

## Конструктор класса

Декларативно описанный класс таблицы содержит в себе конструктор по умолчанию.

In [112]:
ed_user = User(name='ed', fullname='Edward Jones', password = '123456')

Можно переопределить конструктор вручную

```
class User(Base):
    __tablename__ = 'user'

    def __init__(self, name, fullname):
       self.name = name
       self.fullname = fullname

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    password = Column(String)

    addresses = relationship("Address", backref="user",
                             order_by="Address.id")
```

Поле `User.id` является первичным ключом, если его значение не указанно явно или такой id не существует в БД, то объект считается новым. После записи объекта в БД, значение поля id автоматически присваивается.

In [113]:
print(ed_user.name, ed_user.fullname, ed_user.password)

ed Edward Jones 123456

In [114]:
print(ed_user.id)

None

## Сессии

Сессии являются более абстрактным уровнем над механизмом соединения с СУБД `sqlalchemy.engine.Engine.` Они включают в себя функции хранения состояния объектов таблиц и записи этого состояния, по требованию, в БД.

См:

http://docs.sqlalchemy.org/en/latest/orm/session_basics.html

https://ru.wikibooks.org/wiki/SQLAlchemy/Sessions

Сессии создаются при помощи экземпляра класса `sqlalchemy.orm.session.Session.`

In [115]:
from sqlalchemy.orm import Session
session = Session(bind=engine)

In [116]:
session.add(ed_user)

In [117]:
session.commit()

Перед выполнением любого запроса из сессии, состояние сессии автоматически переносится в БД. В нашем случае, не сохраненный объект `ed_user` добавляется в БД.

In [118]:
our_user = session.query(User).filter_by(name='ed').first()

In [119]:
our_user

In [120]:
our_user.id

1

In [121]:
ed_user.id

1

Что проверяет следующее условие?

In [122]:
ed_user == our_user is ed_user

True

In [123]:
session.add_all([
     User(name='wendy', fullname='Wendy Weathersmith'),
     User(name='mary', fullname='Mary Contrary'),
     User(name='fred', fullname='Fred Flinstone')
 ])

Если объект, находящийся в сессии, поменялся, то он помечается как `dirty.` Все измененные объекты в сессии доступны через атрибут `sqlalchemy.orm.session.Session.dirty`

In [124]:
ed_user.fullname = 'Ed Jones'

In [125]:
session.commit()

In [126]:
for i in session.dirty:
    print(i)

Новые объекты, попавшие в сессию после ее сохранения или в новую сессию, доступны через атрибут `sqlalchemy.orm.session.Session.new`

In [127]:
session.new

IdentitySet([])

Метод `sqlalchemy.orm.session.Session.commit()` сохраняет состояние сессии в БД и подтверждает SQL транзакцию, в рамках которой выполнялись все предыдущие запросы.

In [128]:
session.commit()

In [129]:
ed_user.name

'ed'

## SQL запросы через ORM

Операции над атрибутами класса таблицы равносильны операциям над объектом `sqlalchemy.schema.Column.` Поэтому их можно использовать в конструкторе SQL запросов. Результатом выполнения SQL выражения будет список значений записи в БД.

In [130]:
print(User.name == "ed")

"user".name = :name_1

In [131]:
from sqlalchemy import select
sel = select([User.name, User.fullname]).where(User.name == 'ed').order_by(User.id)

In [132]:
session.connection().execute(sel).fetchall()

[('ed', 'Ed Jones')]

ORM позволяет конструировать запросы при помощи метода `sqlalchemy.orm.session.Session.query().` Этот метод создает объект класса `sqlalchemy.orm.query.Query`, который является более высокой абстракцией конструктора SQL выражения в SQLAlchemy.

ORM, в отличии от стандартного конструктора SQL выражения, позволяет создавать запросы более наглядно и возвращать результат в виде объектов которые привязаны к сессии.

In [133]:
for name, fullname in session.query(User.name, User.fullname):
    print(name, fullname)

ed Ed Jones
wendy Wendy Weathersmith
mary Mary Contrary
fred Fred Flinstone

Или комбинировать значения полей с объектами.

In [134]:
for row in session.query(User, User.name):
    print(row.User.name,row.User.fullname, '...',row.name)

ed Ed Jones ... ed
wendy Wendy Weathersmith ... wendy
mary Mary Contrary ... mary
fred Fred Flinstone ... fred

## Ограничения и условия

**LIMIT, OFFSET**

Выбор конкретной строки запроса делается не средствами языка Python, а на стороне СУБД, за счет конструкции `LIMIT ? OFFSET ?`, что значительно ускоряет выполнение запроса. Для программиста это выглядит прозрачно, как будто он работает с Python списком.

In [135]:
u = session.query(User).order_by(User.id)[2]
print(u.fullname)

Mary Contrary

Аналогично работают и Python срезы.

In [136]:
for u in session.query(User).order_by(User.id)[1:3]:
    print(u.fullname)

Wendy Weathersmith
Mary Contrary

**WHERE**

Условие `WHERE` соответствует методу `sqlalchemy.orm.query.Query.filter_by().`

In [137]:
for name, in session.query(User.name).\
                 filter_by(fullname='Ed Jones'):
                 print(name)

ed

Или более функциональному методу `sqlalchemy.orm.query.Query.filter()`

In [138]:
for name, in session.query(User.name).\
                 filter(User.fullname == 'Ed Jones'):
                 print(name)

ed

In [139]:
from sqlalchemy import or_
for name, in session.query(User.name).\
                 filter(or_(User.fullname == 'Ed Jones', User.id < 5)):
                 print(name)

ed
wendy
mary
fred

Последовательное выполнение методов `sqlalchemy.orm.query.Query.filter()` соединяет условия `WHERE` при помощи оператора `AND`, аналогично конструкции `select().where().`

In [140]:
for user in session.query(User).\
                         filter(User.name == 'ed').\
                         filter(User.fullname == 'Ed Jones'):
                         print(user.name)

ed

## Выполнение SQL выражений

Сам объект класса `sqlalchemy.orm.query.Query` не выполняет обращений к БД.

In [141]:
query = session.query(User).filter_by(fullname='Ed Jones')

Для этого существуют специальные методы этого класса, например :

- `sqlalchemy.orm.query.Query.all()`
- `sqlalchemy.orm.query.Query.first()` - выполнит запрос и вернет первую строку запроса или None
- `sqlalchemy.orm.query.Query.one()` - выполнит запрос, вернет первую строку запроса и проверит что она одна и только одна, иначе вызовет исключение sqlalchemy.orm.exc.NoResultFound.

In [142]:
for i in query.all():
    print(i.name)

ed

In [143]:
query.first().name

'ed'

In [144]:
query.one().name

'ed'

In [145]:
query = session.query(User).filter_by(fullname='nonexistent')
query.one()

NoResultFound: ignored

In [ ]:
engine.table_names()

In [ ]:
Address.__table__.drop(engine)

In [ ]:
User.__table__.drop(engine)

In [ ]:
engine.table_names()